In [1]:
import pandas as pd
import numpy as np

In [2]:
dict1 = {
    "name": ['Ashish', 'Harry', 'Rohan', 'Subh'],
    "Salary": [92, 34, 24, 17],
    "City": ['Rampur', 'Kolkata', 'Jaipur', 'Patna']
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

     name  Salary     City
0  Ashish      92   Rampur
1   Harry      34  Kolkata
2   Rohan      24   Jaipur
3    Subh      17    Patna

In [5]:
df.to_csv('data_folder/friends.csv')

In [6]:
# csv file without index
df.to_csv('data_folder/friends_without_index.csv', index=False)

In [7]:
# to show rows from first
df.head(2)

     name  Salary     City
0  Ashish      92   Rampur
1   Harry      34  Kolkata

In [8]:
# to show rows from last
df.tail(2)

    name  Salary    City
2  Rohan      24  Jaipur
3   Subh      17   Patna

In [9]:
# to see the max, min, count etc of the numerical columns
df.describe()

         Salary
count   4.00000
mean   41.75000
std    34.21866
min    17.00000
25%    22.25000
50%    29.00000
75%    48.50000
max    92.00000

In [10]:
data_frame = pd.read_csv('data_folder/ashish.csv')

In [11]:
data_frame

   Train  Speed     City
0    123     12   Rampur
1    456     23  Kolkata
2    789     34   Jaipur
3     12     45    Patna

In [12]:
data_frame['Speed']

0    12
1    23
2    34
3    45
Name: Speed, dtype: int64

In [13]:
data_frame['Speed'][0]

12

In [14]:
data_frame['Speed'][0] = 50

/home/user/Desktop/workspace/python-django-learning/Ecobiased/pandas_tutorial/venv/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [15]:
data_frame

   Train  Speed     City
0    123     50   Rampur
1    456     23  Kolkata
2    789     34   Jaipur
3     12     45    Patna

In [16]:
data_frame.to_csv('data_folder/updated_ashish.csv', index=False)

In [17]:
# code to change the index instead of builtin 0,1,2,3
data_frame.index = ['first', 'second', 'third', 'fourth']

In [18]:
data_frame

        Train  Speed     City
first     123     50   Rampur
second    456     23  Kolkata
third     789     34   Jaipur
fourth     12     45    Patna

In [19]:
ser = pd.Series(np.random.rand(34))

In [20]:
ser

0     0.803515
1     0.359797
2     0.194560
3     0.512145
4     0.972059
5     0.635465
6     0.073874
7     0.161370
8     0.841465
9     0.381143
10    0.172376
11    0.552398
12    0.005645
13    0.352257
14    0.327985
15    0.909657
16    0.176194
17    0.340143
18    0.169233
19    0.732145
20    0.115424
21    0.824555
22    0.445560
23    0.541878
24    0.234357
25    0.722186
26    0.749213
27    0.765970
28    0.011446
29    0.266795
30    0.303568
31    0.128264
32    0.135347
33    0.647195
dtype: float64

In [21]:
type(ser)

pandas.core.series.Series

In [22]:
new_df = pd.DataFrame(np.random.rand(334, 5), index=np.arange(334))

In [23]:
new_df

            0         1         2         3         4
0    0.174692  0.008089  0.826000  0.607135  0.009706
1    0.689753  0.533545  0.504159  0.144343  0.844405
2    0.368315  0.291180  0.480990  0.173310  0.148062
3    0.096618  0.777995  0.579265  0.959333  0.985418
4    0.561035  0.680190  0.349006  0.895789  0.894916
..        ...       ...       ...       ...       ...
329  0.510602  0.020573  0.829107  0.201437  0.366657
330  0.409911  0.206239  0.565981  0.370155  0.191211
331  0.178799  0.789902  0.582036  0.291334  0.337831
332  0.380139  0.244278  0.528747  0.725648  0.078808
333  0.380395  0.067613  0.241501  0.887401  0.994011

[334 rows x 5 columns]

In [24]:
new_df.head(10)

          0         1         2         3         4
0  0.174692  0.008089  0.826000  0.607135  0.009706
1  0.689753  0.533545  0.504159  0.144343  0.844405
2  0.368315  0.291180  0.480990  0.173310  0.148062
3  0.096618  0.777995  0.579265  0.959333  0.985418
4  0.561035  0.680190  0.349006  0.895789  0.894916
5  0.758008  0.215832  0.841084  0.003446  0.680058
6  0.826535  0.381989  0.062792  0.889625  0.723502
7  0.549022  0.348933  0.292267  0.898626  0.317337
8  0.410636  0.565410  0.743794  0.108947  0.860847
9  0.292971  0.809660  0.629917  0.259148  0.605490

In [25]:
type(new_df)

pandas.core.frame.DataFrame

In [26]:
new_df.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.528216    0.489317    0.515892    0.532372    0.507861
std      0.281474    0.294051    0.282938    0.284673    0.285831
min      0.005031    0.001666    0.001653    0.003446    0.003260
25%      0.294653    0.229396    0.286819    0.298104    0.252840
50%      0.557081    0.503193    0.524538    0.540411    0.514033
75%      0.772349    0.742937    0.758277    0.784945    0.747648
max      0.998661    0.996541    0.999737    0.998753    0.999967

In [27]:
new_df.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [28]:
new_df.head()

          0         1         2         3         4
0  0.174692  0.008089  0.826000  0.607135  0.009706
1  0.689753  0.533545  0.504159  0.144343  0.844405
2  0.368315  0.291180  0.480990  0.173310  0.148062
3  0.096618  0.777995  0.579265  0.959333  0.985418
4  0.561035  0.680190  0.349006  0.895789  0.894916

In [29]:
new_df[0][0] = "Ashish"

In [30]:
new_df.head()

           0         1         2         3         4
0     Ashish  0.008089  0.826000  0.607135  0.009706
1   0.689753  0.533545  0.504159  0.144343  0.844405
2   0.368315  0.291180  0.480990  0.173310  0.148062
3  0.0966178  0.777995  0.579265  0.959333  0.985418
4   0.561035  0.680190  0.349006  0.895789  0.894916

In [31]:
new_df.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [32]:
# Check the index.
new_df.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
           dtype='int64', length=334)

In [33]:
# check the columns
new_df.columns

RangeIndex(start=0, stop=5, step=1)

In [34]:
# code to convert a data frame into numpy array.
new_df.to_numpy()

array([['Ashish', 0.008088719721377258, 0.8260001886316128,
        0.6071347072455869, 0.009705553095151975],
       [0.6897525132998961, 0.5335452242481021, 0.5041587858153475,
        0.14434317871112345, 0.8444046832146315],
       [0.368315020684555, 0.29118020561260816, 0.4809897450611059,
        0.17331017183230357, 0.14806170278676778],
       ...,
       [0.17879874948340868, 0.7899016455789677, 0.5820357949392438,
        0.29133389775321905, 0.3378308353042443],
       [0.38013862815707455, 0.24427832609017341, 0.5287468812045499,
        0.7256480066472514, 0.0788081307600601],
       [0.38039452262711504, 0.06761296956451057, 0.24150076777708096,
        0.8874010616331922, 0.9940113270407862]], dtype=object)

In [35]:
new_df[0][0] = 2.3

/home/user/Desktop/workspace/python-django-learning/Ecobiased/pandas_tutorial/venv/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [36]:
new_df.to_numpy

<bound method DataFrame.to_numpy of              0         1         2         3         4
0          2.3  0.008089  0.826000  0.607135  0.009706
1     0.689753  0.533545  0.504159  0.144343  0.844405
2     0.368315  0.291180  0.480990  0.173310  0.148062
3    0.0966178  0.777995  0.579265  0.959333  0.985418
4     0.561035  0.680190  0.349006  0.895789  0.894916
..         ...       ...       ...       ...       ...
329   0.510602  0.020573  0.829107  0.201437  0.366657
330   0.409911  0.206239  0.565981  0.370155  0.191211
331   0.178799  0.789902  0.582036  0.291334  0.337831
332   0.380139  0.244278  0.528747  0.725648  0.078808
333   0.380395  0.067613  0.241501  0.887401  0.994011

[334 rows x 5 columns]>

In [37]:
# code to transpose a dataframe
new_df.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,2.3,0.689753,0.368315,0.0966178,0.561035,0.758008,0.826535,0.549022,0.410636,0.292971,...,0.656106,0.880621,0.843737,0.904309,0.702711,0.510602,0.409911,0.178799,0.380139,0.380395
1,0.00808872,0.533545,0.29118,0.777995,0.68019,0.215832,0.381989,0.348933,0.56541,0.80966,...,0.976338,0.403826,0.784252,0.748522,0.654856,0.0205732,0.206239,0.789902,0.244278,0.067613
2,0.826,0.504159,0.48099,0.579265,0.349006,0.841084,0.0627916,0.292267,0.743794,0.629917,...,0.879454,0.595662,0.908734,0.918287,0.0136845,0.829107,0.565981,0.582036,0.528747,0.241501
3,0.607135,0.144343,0.17331,0.959333,0.895789,0.00344588,0.889625,0.898626,0.108947,0.259148,...,0.405357,0.211156,0.958263,0.830709,0.858595,0.201437,0.370155,0.291334,0.725648,0.887401
4,0.00970555,0.844405,0.148062,0.985418,0.894916,0.680058,0.723502,0.317337,0.860847,0.60549,...,0.505989,0.64949,0.709427,0.978846,0.311467,0.366657,0.191211,0.337831,0.0788081,0.994011

In [38]:
new_df.head()

           0         1         2         3         4
0        2.3  0.008089  0.826000  0.607135  0.009706
1   0.689753  0.533545  0.504159  0.144343  0.844405
2   0.368315  0.291180  0.480990  0.173310  0.148062
3  0.0966178  0.777995  0.579265  0.959333  0.985418
4   0.561035  0.680190  0.349006  0.895789  0.894916

In [39]:
#code to sort my data frame according to index descending order
new_df.sort_index(axis=0, ascending=False)

             0         1         2         3         4
333   0.380395  0.067613  0.241501  0.887401  0.994011
332   0.380139  0.244278  0.528747  0.725648  0.078808
331   0.178799  0.789902  0.582036  0.291334  0.337831
330   0.409911  0.206239  0.565981  0.370155  0.191211
329   0.510602  0.020573  0.829107  0.201437  0.366657
..         ...       ...       ...       ...       ...
4     0.561035  0.680190  0.349006  0.895789  0.894916
3    0.0966178  0.777995  0.579265  0.959333  0.985418
2     0.368315  0.291180  0.480990  0.173310  0.148062
1     0.689753  0.533545  0.504159  0.144343  0.844405
0          2.3  0.008089  0.826000  0.607135  0.009706

[334 rows x 5 columns]

In [40]:
# code to sort the dataframe as per the column.
new_df.sort_index(axis=1, ascending=False)

            4         3         2         1          0
0    0.009706  0.607135  0.826000  0.008089        2.3
1    0.844405  0.144343  0.504159  0.533545   0.689753
2    0.148062  0.173310  0.480990  0.291180   0.368315
3    0.985418  0.959333  0.579265  0.777995  0.0966178
4    0.894916  0.895789  0.349006  0.680190   0.561035
..        ...       ...       ...       ...        ...
329  0.366657  0.201437  0.829107  0.020573   0.510602
330  0.191211  0.370155  0.565981  0.206239   0.409911
331  0.337831  0.291334  0.582036  0.789902   0.178799
332  0.078808  0.725648  0.528747  0.244278   0.380139
333  0.994011  0.887401  0.241501  0.067613   0.380395

[334 rows x 5 columns]

In [41]:
newdf2 = new_df

In [42]:
newdf2[0][0] = 678

/home/user/Desktop/workspace/python-django-learning/Ecobiased/pandas_tutorial/venv/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [43]:
new_df

             0         1         2         3         4
0          678  0.008089  0.826000  0.607135  0.009706
1     0.689753  0.533545  0.504159  0.144343  0.844405
2     0.368315  0.291180  0.480990  0.173310  0.148062
3    0.0966178  0.777995  0.579265  0.959333  0.985418
4     0.561035  0.680190  0.349006  0.895789  0.894916
..         ...       ...       ...       ...       ...
329   0.510602  0.020573  0.829107  0.201437  0.366657
330   0.409911  0.206239  0.565981  0.370155  0.191211
331   0.178799  0.789902  0.582036  0.291334  0.337831
332   0.380139  0.244278  0.528747  0.725648  0.078808
333   0.380395  0.067613  0.241501  0.887401  0.994011

[334 rows x 5 columns]

In [44]:
newdf2

             0         1         2         3         4
0          678  0.008089  0.826000  0.607135  0.009706
1     0.689753  0.533545  0.504159  0.144343  0.844405
2     0.368315  0.291180  0.480990  0.173310  0.148062
3    0.0966178  0.777995  0.579265  0.959333  0.985418
4     0.561035  0.680190  0.349006  0.895789  0.894916
..         ...       ...       ...       ...       ...
329   0.510602  0.020573  0.829107  0.201437  0.366657
330   0.409911  0.206239  0.565981  0.370155  0.191211
331   0.178799  0.789902  0.582036  0.291334  0.337831
332   0.380139  0.244278  0.528747  0.725648  0.078808
333   0.380395  0.067613  0.241501  0.887401  0.994011

[334 rows x 5 columns]

In [45]:
newdf3 = newdf2.copy()

In [46]:
newdf3[0][0] = 'ash'

/home/user/Desktop/workspace/python-django-learning/Ecobiased/pandas_tutorial/venv/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [47]:
newdf2

             0         1         2         3         4
0          678  0.008089  0.826000  0.607135  0.009706
1     0.689753  0.533545  0.504159  0.144343  0.844405
2     0.368315  0.291180  0.480990  0.173310  0.148062
3    0.0966178  0.777995  0.579265  0.959333  0.985418
4     0.561035  0.680190  0.349006  0.895789  0.894916
..         ...       ...       ...       ...       ...
329   0.510602  0.020573  0.829107  0.201437  0.366657
330   0.409911  0.206239  0.565981  0.370155  0.191211
331   0.178799  0.789902  0.582036  0.291334  0.337831
332   0.380139  0.244278  0.528747  0.725648  0.078808
333   0.380395  0.067613  0.241501  0.887401  0.994011

[334 rows x 5 columns]

In [48]:
newdf3

             0         1         2         3         4
0          ash  0.008089  0.826000  0.607135  0.009706
1     0.689753  0.533545  0.504159  0.144343  0.844405
2     0.368315  0.291180  0.480990  0.173310  0.148062
3    0.0966178  0.777995  0.579265  0.959333  0.985418
4     0.561035  0.680190  0.349006  0.895789  0.894916
..         ...       ...       ...       ...       ...
329   0.510602  0.020573  0.829107  0.201437  0.366657
330   0.409911  0.206239  0.565981  0.370155  0.191211
331   0.178799  0.789902  0.582036  0.291334  0.337831
332   0.380139  0.244278  0.528747  0.725648  0.078808
333   0.380395  0.067613  0.241501  0.887401  0.994011

[334 rows x 5 columns]

In [49]:
newdf4 = newdf3[:]

In [50]:
newdf4[0][0] = 0.3456

/home/user/Desktop/workspace/python-django-learning/Ecobiased/pandas_tutorial/venv/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
/home/user/Desktop/workspace/python-django-learning/Ecobiased/pandas_tutorial/venv/lib/python3.6/site-packages/IPython/core/interactiveshell.py:3343: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  exec(code_obj, self.user_global_ns, self.user_ns)

In [51]:
newdf3

             0         1         2         3         4
0       0.3456  0.008089  0.826000  0.607135  0.009706
1     0.689753  0.533545  0.504159  0.144343  0.844405
2     0.368315  0.291180  0.480990  0.173310  0.148062
3    0.0966178  0.777995  0.579265  0.959333  0.985418
4     0.561035  0.680190  0.349006  0.895789  0.894916
..         ...       ...       ...       ...       ...
329   0.510602  0.020573  0.829107  0.201437  0.366657
330   0.409911  0.206239  0.565981  0.370155  0.191211
331   0.178799  0.789902  0.582036  0.291334  0.337831
332   0.380139  0.244278  0.528747  0.725648  0.078808
333   0.380395  0.067613  0.241501  0.887401  0.994011

[334 rows x 5 columns]

In [52]:
new_df

             0         1         2         3         4
0          678  0.008089  0.826000  0.607135  0.009706
1     0.689753  0.533545  0.504159  0.144343  0.844405
2     0.368315  0.291180  0.480990  0.173310  0.148062
3    0.0966178  0.777995  0.579265  0.959333  0.985418
4     0.561035  0.680190  0.349006  0.895789  0.894916
..         ...       ...       ...       ...       ...
329   0.510602  0.020573  0.829107  0.201437  0.366657
330   0.409911  0.206239  0.565981  0.370155  0.191211
331   0.178799  0.789902  0.582036  0.291334  0.337831
332   0.380139  0.244278  0.528747  0.725648  0.078808
333   0.380395  0.067613  0.241501  0.887401  0.994011

[334 rows x 5 columns]

In [53]:
new_df.loc[0,0] = 890

In [54]:
new_df

             0         1         2         3         4
0          890  0.008089  0.826000  0.607135  0.009706
1     0.689753  0.533545  0.504159  0.144343  0.844405
2     0.368315  0.291180  0.480990  0.173310  0.148062
3    0.0966178  0.777995  0.579265  0.959333  0.985418
4     0.561035  0.680190  0.349006  0.895789  0.894916
..         ...       ...       ...       ...       ...
329   0.510602  0.020573  0.829107  0.201437  0.366657
330   0.409911  0.206239  0.565981  0.370155  0.191211
331   0.178799  0.789902  0.582036  0.291334  0.337831
332   0.380139  0.244278  0.528747  0.725648  0.078808
333   0.380395  0.067613  0.241501  0.887401  0.994011

[334 rows x 5 columns]

In [55]:
# code to change the column name
new_df.columns = list('abcde')

In [56]:
new_df

             a         b         c         d         e
0          890  0.008089  0.826000  0.607135  0.009706
1     0.689753  0.533545  0.504159  0.144343  0.844405
2     0.368315  0.291180  0.480990  0.173310  0.148062
3    0.0966178  0.777995  0.579265  0.959333  0.985418
4     0.561035  0.680190  0.349006  0.895789  0.894916
..         ...       ...       ...       ...       ...
329   0.510602  0.020573  0.829107  0.201437  0.366657
330   0.409911  0.206239  0.565981  0.370155  0.191211
331   0.178799  0.789902  0.582036  0.291334  0.337831
332   0.380139  0.244278  0.528747  0.725648  0.078808
333   0.380395  0.067613  0.241501  0.887401  0.994011

[334 rows x 5 columns]

In [57]:
new_df.columns = ['A', 'B', 'c', 'D', 'E']

In [58]:
new_df

             A         B         c         D         E
0          890  0.008089  0.826000  0.607135  0.009706
1     0.689753  0.533545  0.504159  0.144343  0.844405
2     0.368315  0.291180  0.480990  0.173310  0.148062
3    0.0966178  0.777995  0.579265  0.959333  0.985418
4     0.561035  0.680190  0.349006  0.895789  0.894916
..         ...       ...       ...       ...       ...
329   0.510602  0.020573  0.829107  0.201437  0.366657
330   0.409911  0.206239  0.565981  0.370155  0.191211
331   0.178799  0.789902  0.582036  0.291334  0.337831
332   0.380139  0.244278  0.528747  0.725648  0.078808
333   0.380395  0.067613  0.241501  0.887401  0.994011

[334 rows x 5 columns]

In [59]:
new_df.loc[0, 'A'] = 'Ashish Kumar'

In [60]:
new_df

                A         B         c         D         E
0    Ashish Kumar  0.008089  0.826000  0.607135  0.009706
1        0.689753  0.533545  0.504159  0.144343  0.844405
2        0.368315  0.291180  0.480990  0.173310  0.148062
3       0.0966178  0.777995  0.579265  0.959333  0.985418
4        0.561035  0.680190  0.349006  0.895789  0.894916
..            ...       ...       ...       ...       ...
329      0.510602  0.020573  0.829107  0.201437  0.366657
330      0.409911  0.206239  0.565981  0.370155  0.191211
331      0.178799  0.789902  0.582036  0.291334  0.337831
332      0.380139  0.244278  0.528747  0.725648  0.078808
333      0.380395  0.067613  0.241501  0.887401  0.994011

[334 rows x 5 columns]

In [61]:
new_df.loc[0, 0] = 567

In [62]:
new_df

                A         B         c         D         E      0
0    Ashish Kumar  0.008089  0.826000  0.607135  0.009706  567.0
1        0.689753  0.533545  0.504159  0.144343  0.844405    NaN
2        0.368315  0.291180  0.480990  0.173310  0.148062    NaN
3       0.0966178  0.777995  0.579265  0.959333  0.985418    NaN
4        0.561035  0.680190  0.349006  0.895789  0.894916    NaN
..            ...       ...       ...       ...       ...    ...
329      0.510602  0.020573  0.829107  0.201437  0.366657    NaN
330      0.409911  0.206239  0.565981  0.370155  0.191211    NaN
331      0.178799  0.789902  0.582036  0.291334  0.337831    NaN
332      0.380139  0.244278  0.528747  0.725648  0.078808    NaN
333      0.380395  0.067613  0.241501  0.887401  0.994011    NaN

[334 rows x 6 columns]

In [63]:
# code to drop a column
new_df.drop(0, axis=1)

                A         B         c         D         E
0    Ashish Kumar  0.008089  0.826000  0.607135  0.009706
1        0.689753  0.533545  0.504159  0.144343  0.844405
2        0.368315  0.291180  0.480990  0.173310  0.148062
3       0.0966178  0.777995  0.579265  0.959333  0.985418
4        0.561035  0.680190  0.349006  0.895789  0.894916
..            ...       ...       ...       ...       ...
329      0.510602  0.020573  0.829107  0.201437  0.366657
330      0.409911  0.206239  0.565981  0.370155  0.191211
331      0.178799  0.789902  0.582036  0.291334  0.337831
332      0.380139  0.244278  0.528747  0.725648  0.078808
333      0.380395  0.067613  0.241501  0.887401  0.994011

[334 rows x 5 columns]

In [64]:
new_df.loc[0,0] = 768

In [65]:
new_df.head()

              A         B         c         D         E      0
0  Ashish Kumar  0.008089  0.826000  0.607135  0.009706  768.0
1      0.689753  0.533545  0.504159  0.144343  0.844405    NaN
2      0.368315  0.291180  0.480990  0.173310  0.148062    NaN
3     0.0966178  0.777995  0.579265  0.959333  0.985418    NaN
4      0.561035  0.680190  0.349006  0.895789  0.894916    NaN

In [66]:
#It just drop the value of zero column df.
new_df.drop(0)

             A         B         c         D         E   0
1     0.689753  0.533545  0.504159  0.144343  0.844405 NaN
2     0.368315  0.291180  0.480990  0.173310  0.148062 NaN
3    0.0966178  0.777995  0.579265  0.959333  0.985418 NaN
4     0.561035  0.680190  0.349006  0.895789  0.894916 NaN
5     0.758008  0.215832  0.841084  0.003446  0.680058 NaN
..         ...       ...       ...       ...       ...  ..
329   0.510602  0.020573  0.829107  0.201437  0.366657 NaN
330   0.409911  0.206239  0.565981  0.370155  0.191211 NaN
331   0.178799  0.789902  0.582036  0.291334  0.337831 NaN
332   0.380139  0.244278  0.528747  0.725648  0.078808 NaN
333   0.380395  0.067613  0.241501  0.887401  0.994011 NaN

[333 rows x 6 columns]

In [67]:
new_df.drop(0, axis=1)

                A         B         c         D         E
0    Ashish Kumar  0.008089  0.826000  0.607135  0.009706
1        0.689753  0.533545  0.504159  0.144343  0.844405
2        0.368315  0.291180  0.480990  0.173310  0.148062
3       0.0966178  0.777995  0.579265  0.959333  0.985418
4        0.561035  0.680190  0.349006  0.895789  0.894916
..            ...       ...       ...       ...       ...
329      0.510602  0.020573  0.829107  0.201437  0.366657
330      0.409911  0.206239  0.565981  0.370155  0.191211
331      0.178799  0.789902  0.582036  0.291334  0.337831
332      0.380139  0.244278  0.528747  0.725648  0.078808
333      0.380395  0.067613  0.241501  0.887401  0.994011

[334 rows x 5 columns]

In [68]:
new_df.head()

              A         B         c         D         E      0
0  Ashish Kumar  0.008089  0.826000  0.607135  0.009706  768.0
1      0.689753  0.533545  0.504159  0.144343  0.844405    NaN
2      0.368315  0.291180  0.480990  0.173310  0.148062    NaN
3     0.0966178  0.777995  0.579265  0.959333  0.985418    NaN
4      0.561035  0.680190  0.349006  0.895789  0.894916    NaN

In [69]:
new_df = new_df.drop(0, axis=1)

In [70]:
new_df.head()

              A         B         c         D         E
0  Ashish Kumar  0.008089  0.826000  0.607135  0.009706
1      0.689753  0.533545  0.504159  0.144343  0.844405
2      0.368315  0.291180  0.480990  0.173310  0.148062
3     0.0966178  0.777995  0.579265  0.959333  0.985418
4      0.561035  0.680190  0.349006  0.895789  0.894916

In [71]:
#code to get some specific column and row.
new_df.loc[1,'A']

0.6897525132998961

In [72]:
new_df.loc[[1,2],'c']

1    0.504159
2    0.480990
Name: c, dtype: float64

In [74]:
new_df.loc[[1, 2], ['c', 'D']]

          c         D
1  0.504159  0.144343
2  0.480990  0.173310

In [75]:
# code to get all the rows.
new_df.loc[:,['c', 'D']]

            c         D
0    0.826000  0.607135
1    0.504159  0.144343
2    0.480990  0.173310
3    0.579265  0.959333
4    0.349006  0.895789
..        ...       ...
329  0.829107  0.201437
330  0.565981  0.370155
331  0.582036  0.291334
332  0.528747  0.725648
333  0.241501  0.887401

[334 rows x 2 columns]

In [76]:
# code to get all the columns
new_df.loc[[1,2],:]

          A         B         c         D         E
1  0.689753  0.533545  0.504159  0.144343  0.844405
2  0.368315  0.291180  0.480990  0.173310  0.148062

In [82]:
new_df.loc[0,0] = 0.23

In [90]:
new_df = new_df.drop(0, axis=1)

In [91]:
new_df

                A         B         c         D         E
0    Ashish Kumar  0.008089  0.826000  0.607135  0.009706
1        0.689753  0.533545  0.504159  0.144343  0.844405
2        0.368315  0.291180  0.480990  0.173310  0.148062
3       0.0966178  0.777995  0.579265  0.959333  0.985418
4        0.561035  0.680190  0.349006  0.895789  0.894916
..            ...       ...       ...       ...       ...
329      0.510602  0.020573  0.829107  0.201437  0.366657
330      0.409911  0.206239  0.565981  0.370155  0.191211
331      0.178799  0.789902  0.582036  0.291334  0.337831
332      0.380139  0.244278  0.528747  0.725648  0.078808
333      0.380395  0.067613  0.241501  0.887401  0.994011

[334 rows x 5 columns]

In [98]:
new_df.loc[0, 'A'] = 0.34

In [96]:
new_df = new_df.drop(0, axis=1)

In [99]:
new_df

             A         B         c         D         E
0         0.34  0.008089  0.826000  0.607135  0.009706
1     0.689753  0.533545  0.504159  0.144343  0.844405
2     0.368315  0.291180  0.480990  0.173310  0.148062
3    0.0966178  0.777995  0.579265  0.959333  0.985418
4     0.561035  0.680190  0.349006  0.895789  0.894916
..         ...       ...       ...       ...       ...
329   0.510602  0.020573  0.829107  0.201437  0.366657
330   0.409911  0.206239  0.565981  0.370155  0.191211
331   0.178799  0.789902  0.582036  0.291334  0.337831
332   0.380139  0.244278  0.528747  0.725648  0.078808
333   0.380395  0.067613  0.241501  0.887401  0.994011

[334 rows x 5 columns]

In [100]:
# code to get all the rows which column A value is less than 0.3
new_df.loc[(new_df['A']<0.3)]

             A         B         c         D         E
3    0.0966178  0.777995  0.579265  0.959333  0.985418
9     0.292971  0.809660  0.629917  0.259148  0.605490
11    0.243921  0.420079  0.077766  0.991504  0.757055
12    0.213082  0.291074  0.876060  0.806271  0.301069
13    0.260851  0.076666  0.180451  0.588694  0.613813
..         ...       ...       ...       ...       ...
310   0.196373  0.589241  0.250737  0.783288  0.467869
313   0.103532  0.491012  0.748347  0.764394  0.028267
316   0.141781  0.322545  0.519083  0.047565  0.194569
317  0.0676551  0.080844  0.985424  0.509295  0.938951
331   0.178799  0.789902  0.582036  0.291334  0.337831

[84 rows x 5 columns]

In [101]:
# code to get all the rows where column A value is less than 0.3 and C is greater than 0.1
new_df.loc[(new_df['A']<0.3) & (new_df['c']>0.1)]

             A         B         c         D         E
3    0.0966178  0.777995  0.579265  0.959333  0.985418
9     0.292971  0.809660  0.629917  0.259148  0.605490
12    0.213082  0.291074  0.876060  0.806271  0.301069
13    0.260851  0.076666  0.180451  0.588694  0.613813
16    0.275825  0.080590  0.309503  0.489502  0.634455
..         ...       ...       ...       ...       ...
310   0.196373  0.589241  0.250737  0.783288  0.467869
313   0.103532  0.491012  0.748347  0.764394  0.028267
316   0.141781  0.322545  0.519083  0.047565  0.194569
317  0.0676551  0.080844  0.985424  0.509295  0.938951
331   0.178799  0.789902  0.582036  0.291334  0.337831

[78 rows x 5 columns]

In [102]:
new_df.head(2)

          A         B         c         D         E
0      0.34  0.008089  0.826000  0.607135  0.009706
1  0.689753  0.533545  0.504159  0.144343  0.844405

In [103]:
new_df.iloc[0, 4]

0.009705553095151975

In [105]:
new_df.iloc[[0,1], [1,2]]

          B         c
0  0.008089  0.826000
1  0.533545  0.504159

In [106]:
new_df.drop(0)

             A         B         c         D         E
1     0.689753  0.533545  0.504159  0.144343  0.844405
2     0.368315  0.291180  0.480990  0.173310  0.148062
3    0.0966178  0.777995  0.579265  0.959333  0.985418
4     0.561035  0.680190  0.349006  0.895789  0.894916
5     0.758008  0.215832  0.841084  0.003446  0.680058
..         ...       ...       ...       ...       ...
329   0.510602  0.020573  0.829107  0.201437  0.366657
330   0.409911  0.206239  0.565981  0.370155  0.191211
331   0.178799  0.789902  0.582036  0.291334  0.337831
332   0.380139  0.244278  0.528747  0.725648  0.078808
333   0.380395  0.067613  0.241501  0.887401  0.994011

[333 rows x 5 columns]

In [108]:
new_df.drop(['A', 'c'], axis=1)

            B         D         E
0    0.008089  0.607135  0.009706
1    0.533545  0.144343  0.844405
2    0.291180  0.173310  0.148062
3    0.777995  0.959333  0.985418
4    0.680190  0.895789  0.894916
..        ...       ...       ...
329  0.020573  0.201437  0.366657
330  0.206239  0.370155  0.191211
331  0.789902  0.291334  0.337831
332  0.244278  0.725648  0.078808
333  0.067613  0.887401  0.994011

[334 rows x 3 columns]

In [109]:
# code to change the new_df means it will modify the original only.
new_df.drop(['A', 'c'], axis=1, inplace=True)

In [110]:
new_df

            B         D         E
0    0.008089  0.607135  0.009706
1    0.533545  0.144343  0.844405
2    0.291180  0.173310  0.148062
3    0.777995  0.959333  0.985418
4    0.680190  0.895789  0.894916
..        ...       ...       ...
329  0.020573  0.201437  0.366657
330  0.206239  0.370155  0.191211
331  0.789902  0.291334  0.337831
332  0.244278  0.725648  0.078808
333  0.067613  0.887401  0.994011

[334 rows x 3 columns]

In [111]:
new_df.drop([1,5], axis=0, inplace=True)

In [112]:
new_df

            B         D         E
0    0.008089  0.607135  0.009706
2    0.291180  0.173310  0.148062
3    0.777995  0.959333  0.985418
4    0.680190  0.895789  0.894916
6    0.381989  0.889625  0.723502
..        ...       ...       ...
329  0.020573  0.201437  0.366657
330  0.206239  0.370155  0.191211
331  0.789902  0.291334  0.337831
332  0.244278  0.725648  0.078808
333  0.067613  0.887401  0.994011

[332 rows x 3 columns]

In [113]:
# code to reset the index of a dataframe. but it will add one column.
new_df.reset_index()

     index         B         D         E
0        0  0.008089  0.607135  0.009706
1        2  0.291180  0.173310  0.148062
2        3  0.777995  0.959333  0.985418
3        4  0.680190  0.895789  0.894916
4        6  0.381989  0.889625  0.723502
..     ...       ...       ...       ...
327    329  0.020573  0.201437  0.366657
328    330  0.206239  0.370155  0.191211
329    331  0.789902  0.291334  0.337831
330    332  0.244278  0.725648  0.078808
331    333  0.067613  0.887401  0.994011

[332 rows x 4 columns]

In [115]:
# code to reset the index of a dataframe without adding any column.
new_df.reset_index(drop=True)

            B         D         E
0    0.008089  0.607135  0.009706
1    0.291180  0.173310  0.148062
2    0.777995  0.959333  0.985418
3    0.680190  0.895789  0.894916
4    0.381989  0.889625  0.723502
..        ...       ...       ...
327  0.020573  0.201437  0.366657
328  0.206239  0.370155  0.191211
329  0.789902  0.291334  0.337831
330  0.244278  0.725648  0.078808
331  0.067613  0.887401  0.994011

[332 rows x 3 columns]

In [116]:
new_df.reset_index(drop=True, inplace=True)

In [117]:
new_df

            B         D         E
0    0.008089  0.607135  0.009706
1    0.291180  0.173310  0.148062
2    0.777995  0.959333  0.985418
3    0.680190  0.895789  0.894916
4    0.381989  0.889625  0.723502
..        ...       ...       ...
327  0.020573  0.201437  0.366657
328  0.206239  0.370155  0.191211
329  0.789902  0.291334  0.337831
330  0.244278  0.725648  0.078808
331  0.067613  0.887401  0.994011

[332 rows x 3 columns]

In [118]:
new_df['B'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
327    False
328    False
329    False
330    False
331    False
Name: B, Length: 332, dtype: bool

In [119]:
new_df['B'] = None

In [120]:
new_df

        B         D         E
0    None  0.607135  0.009706
1    None  0.173310  0.148062
2    None  0.959333  0.985418
3    None  0.895789  0.894916
4    None  0.889625  0.723502
..    ...       ...       ...
327  None  0.201437  0.366657
328  None  0.370155  0.191211
329  None  0.291334  0.337831
330  None  0.725648  0.078808
331  None  0.887401  0.994011

[332 rows x 3 columns]

In [121]:
new_df['B'].isnull()

0      True
1      True
2      True
3      True
4      True
       ...
327    True
328    True
329    True
330    True
331    True
Name: B, Length: 332, dtype: bool

In [122]:
new_df.loc[:,'B'] = None

In [123]:
new_df['B'].isnull()

0      True
1      True
2      True
3      True
4      True
       ...
327    True
328    True
329    True
330    True
331    True
Name: B, Length: 332, dtype: bool

In [124]:
new_df.loc[:,'B']=34

In [125]:
new_df

      B         D         E
0    34  0.607135  0.009706
1    34  0.173310  0.148062
2    34  0.959333  0.985418
3    34  0.895789  0.894916
4    34  0.889625  0.723502
..   ..       ...       ...
327  34  0.201437  0.366657
328  34  0.370155  0.191211
329  34  0.291334  0.337831
330  34  0.725648  0.078808
331  34  0.887401  0.994011

[332 rows x 3 columns]

In [126]:
df = pd.DataFrame({"name":['Ashish', 'Kumar', 'Sah'],
                  "toy":[np.nan, 'BatMobile', 'BullWhip'],
                  "born":[pd.NaT, pd.Timestamp('1940-04-25'),pd.NaT]})

In [127]:
df

     name        toy       born
0  Ashish        NaN        NaT
1   Kumar  BatMobile 1940-04-25
2     Sah   BullWhip        NaT

In [129]:
df.dropna()

    name        toy       born
1  Kumar  BatMobile 1940-04-25

In [131]:
# code to remove the Na when all the element of a column are Na
df.dropna(how='all')

     name        toy       born
0  Ashish        NaN        NaT
1   Kumar  BatMobile 1940-04-25
2     Sah   BullWhip        NaT

In [133]:
df1 = pd.DataFrame({"name":['Ashish', 'Kumar', 'Sah'],
                  "toy":[np.nan, np.nan, np.nan],
                  "born":[pd.NaT, pd.Timestamp('1940-04-25'),pd.NaT]})

In [134]:
df1

     name  toy       born
0  Ashish  NaN        NaT
1   Kumar  NaN 1940-04-25
2     Sah  NaN        NaT

In [136]:
df1.dropna(how='all', axis=1)

     name       born
0  Ashish        NaT
1   Kumar 1940-04-25
2     Sah        NaT